burakenez/gd32e23x-demo-suites-cmake-vscode/Drivers/BSP/GD32E231K_EVAL/gd32e231k_lcd_eval.c
    LCD_CS_CLR;

    lcd_set_xy(x0, y0);
    /* calculate x distance */
    dx = x1 - x0;
    /* calculate y distance */
    dy = y1 - y0;

    if(dx >= 0) {
        x_inc = 1;
    } else {
        x_inc = -1;
        dx = -dx;
    }

    if(dy >= 0) {
        y_inc = 1;
    } else {
        y_inc = -1;
        dy    = -dy;
    }

    dx2 = dx << 1;
    dy2 = dy << 1;

    if(dx > dy) {
        /* initialize error */
        error = dy2 - dx;
        /* draw the line */
        for(index = 0; index <= dx; index ++) {
            lcd_draw_point(x0, y0, color);
            /* test if error has overflowed */
            if(0 <= error) {
                error -= dx2;
                /* move to next line */
                y0 += y_inc;
            }
            /* adjust the error term */
            error += dy2;
            /* move to the next pixel */
            x0 += x_inc;
        }
    } else {
        /* initialize error term */
        error = dx2 - dy;
        /* draw the linedraw the line*/
        for(index = 0; index <= dy; index ++) {
            /* set the pixel */
            lcd_draw_point(x0, y0, color);

            /* test if error overflowed */
            if(0 <= error) {
                error -= dy2;
                /* move to next line */
                x0 += x_inc;
            }
            /* adjust the error term */
            error += dx2;

            /* move to the next pixel */
            y0 += y_inc;
        }
    }
    LCD_CS_SET;
}

/*!
    \brief      gui box
    \param[in]  x: the x position of the start point
    \param[in]  y: the y position of the start point
    \param[in]  w: the width of the box
    \param[in]  h: the high of the box
    \param[in]  bc: display background color
    \param[out] none
    \retval     none
*/
void lcd_rect_draw(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint16_t line_color)
{
    LCD_CS_CLR;

    /* gui draw line*/
    lcd_line_draw(x, y, x + w, y, line_color);
    lcd_line_draw(x + w, y, x + w, y + h, line_color);
    lcd_line_draw(x, y + h, x + w, y + h, line_color);
    lcd_line_draw(x, y, x, y + h, line_color);

    LCD_CS_SET;
}

/*!
    \brief      lcd box
    \param[in]  x: the x position of the start point
    \param[in]  y: the y position of the start point
    \param[in]  w: the width of the box
    \param[in]  h: the high of the box
    \param[in]  bc: display background color
    \param[out] none
    \retval     none
*/
void lcd_box(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint16_t bc)
{
    LCD_CS_CLR;

    /* gui draw line*/
    lcd_line_draw(x, y, x + w, y, 0xEF7D);
    lcd_line_draw(x + w - 1, y + 1, x + w - 1, y + 1 + h, 0x2965);
    lcd_line_draw(x, y + h, x + w, y + h, 0x2965);
    lcd_line_draw(x, y, x, y + h, 0xEF7D);
    lcd_line_draw(x + 1, y + 1, x + 1 + w - 2, y + 1 + h - 2, bc);

    LCD_CS_SET;
}

/*!
    \brief      lcd box2
    \param[in]  x: the x position of the start point
    \param[in]  y: the y position of the start point
    \param[in]  w: the width of the box
    \param[in]  h: the high of the box
    \param[in]  mode: display color combination mode
    \param[out] none
    \retval     none
*/
void lcd_box2(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint8_t mode)
{
    LCD_CS_CLR;

    /* gui box2 display mode0 */
    if(0 == mode) {
        lcd_line_draw(x, y, x + w, y, 0xEF7D);
        lcd_line_draw(x + w - 1, y + 1, x + w - 1, y + 1 + h, 0x2965);
        lcd_line_draw(x, y + h, x + w, y + h, 0x2965);
        lcd_line_draw(x, y, x, y + h, 0xEF7D);
    }
    /* gui box2 display mode1 */
    if(1 == mode) {
        lcd_line_draw(x, y, x + w, y, 0x2965);
        lcd_line_draw(x + w - 1, y + 1, x + w - 1, y + 1 + h, 0xEF7D);
        lcd_line_draw(x, y + h, x + w, y + h, 0xEF7D);
        lcd_line_draw(x, y, x, y + h, 0x2965);
    }
    /* gui box2 display mode2 */
    if(2 == mode) {
        lcd_line_draw(x, y, x + w, y, 0xffff);
        lcd_line_draw(x + w - 1, y + 1, x + w - 1, y + 1 + h, 0xffff);
        lcd_line_draw(x, y + h, x + w, y + h, 0xffff);
        lcd_line_draw(x, y, x, y + h, 0xffff);
    }
    LCD_CS_SET;
}

/*!
    \brief      gui rect
    \param[in]  x1: the x position of the start point
    \param[in]  y1: the y position of the start point
    \param[in]  x2: the x position of the end point
    \param[in]  y2: the y position of the end point
    \param[in]  fc: display color of font
    \param[out] none
    \retval     none
*/
void lcd_rect_color_draw(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint16_t fc)
{
    int ix, iy;
    LCD_CS_CLR;
    for(ix = x1; ix < x2; ix ++) {
        for(iy = y1; iy < y2; iy ++)
            /* set the pixel */
        {
            lcd_draw_point(ix, iy, fc);
        }
    }

    LCD_CS_SET;
}

/*!
    \brief      display button down
    \param[in]  x1: the x position of the start point
    \param[in]  y1: the y position of the start point
    \param[in]  x2: the x position of the end point
    \param[in]  y2: the y position of the end point
    \param[out] none
    \retval     none
*/
void display_button_down(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2)
{
    LCD_CS_CLR;

    /* gui draw line with gray color*/
    lcd_line_draw(x1, y1, x2, y1, GRAY2);
    lcd_line_draw(x1 + 1, y1 + 1, x2, y1 + 1, GRAY1);
    lcd_line_draw(x1, y1, x1, y2, GRAY2);
    lcd_line_draw(x1 + 1, y1 + 1, x1 + 1, y2, GRAY1);

    /* gui draw line with white color*/
    lcd_line_draw(x1, y2, x2, y2, WHITE);
    lcd_line_draw(x2, y1, x2, y2, WHITE);
    LCD_CS_SET;
}

/*!
    \brief      display button up
    \param[in]  x1: the x position of the start point
    \param[in]  y1: the y position of the start point
    \param[in]  x2: the x position of the end point
    \param[in]  y2: the y position of the end point
    \param[out] none
    \retval     none
*/
void display_button_up(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2)
{
    LCD_CS_CLR;

    /* gui draw line with white color*/
    lcd_line_draw(x1, y1, x2, y1, WHITE);
    lcd_line_draw(x1, y1, x1, y2, WHITE);

