burakenez/gd32e23x-demo-suites-cmake-vscode/Drivers/BSP/GD32E231K_EVAL/gd32e231k_lcd_eval.c
    /* gui draw line with gray color*/
    lcd_line_draw(x1 + 1, y2 - 1, x2, y2 - 1, GRAY1);
    lcd_line_draw(x1, y2, x2, y2, GRAY2);
    lcd_line_draw(x2 - 1, y1 + 1, x2 - 1, y2, GRAY1);
    lcd_line_draw(x2, y1, x2, y2, GRAY2);
    LCD_CS_SET;
}

/*!
    \brief      gui draw font to gbk16
    \param[in]  x: the x position of the start point
    \param[in]  y: the y position of the start point
    \param[in]  fc: display color of font
    \param[in]  bc: display background color
    \param[in]  *s: display char
    \param[out] none
    \retval     none
*/
void lcd_draw_font_gbk16(uint16_t x, uint16_t y, uint16_t fc, uint16_t bc, char *s)
{
    unsigned char i, j;
    unsigned short k, x0;
    x0 = x;

    LCD_CS_CLR;
    while(*s) {
        /* ASCII character table from 32 to 128 */
        if(((uint8_t)(*s)) < 128) {
            k = *s;
            if(13 == k) {
                x = x0;
                y += 16;
            } else {
                if(k > 32) {
                    k -= 32;
                } else {
                    k = 0;
                }
                for(i = 0; i < 16; i ++)
                    for(j = 0; j < 8; j ++) {
                        if(asc16[k * 16 + i] & (0x80 >> j))
                            /* draw a point on the lcd */
                        {
                            lcd_draw_point(x + j, y + i, fc);
                        } else {
                            if(fc != bc)
                                /* draw a point on the lcd */
                            {
                                lcd_draw_point(x + j, y + i, bc);
                            }
                        }
                    }
                x += 8;
            }
            s ++;
        } else {
            for(k = 0; k < hz16_num; k ++) {
                if((hz16[k].Index[0] == *(s)) && (hz16[k].Index[1] == *(s + 1))) {
                    for(i = 0; i < 16; i ++) {
                        for(j = 0; j < 8; j ++) {
                            if(hz16[k].Msk[i * 2] & (0x80 >> j))
                                /* draw a point on the lcd */
                            {
                                lcd_draw_point(x + j, y + i, fc);
                            } else {
                                if(fc != bc)
                                    /* draw a point on the lcd */
                                {
                                    lcd_draw_point(x + j, y + i, bc);
                                }
                            }
                        }
                        for(j = 0; j < 8; j ++) {
                            if(hz16[k].Msk[i * 2 + 1] & (0x80 >> j))
                                /* draw a point on the lcd */
                            {
                                lcd_draw_point(x + j + 8, y + i, fc);
                            } else {
                                if(fc != bc)
                                    /* draw a point on the lcd */
                                {
                                    lcd_draw_point(x + j + 8, y + i, bc);
                                }
                            }
                        }
                    }
                }
            }
            s += 3;
            x += 16;
        }
    }
    LCD_CS_SET;
}

/*!
    \brief      gui draw font to gbk24
    \param[in]  x: the x position of the start point
    \param[in]  y: the y position of the start point
    \param[in]  fc: display color of font
    \param[in]  bc: display background color
    \param[in]  *s: display char
    \param[out] none
    \retval     none
*/
void lcd_draw_font_gbk24(uint16_t x, uint16_t y, uint16_t fc, uint16_t bc, char *s)
{
    unsigned char i, j;
    unsigned short k;

    LCD_CS_CLR;
    while(*s) {
        /* ASCII character table from 32 to 128 */
        if(((uint8_t)(*s)) < 0x80) {
            k = *s;
            if(k > 32) {
                k -= 32;
            } else {
                k = 0;
            }

            for(i = 0; i < 16; i ++)
                for(j = 0; j < 8; j ++) {
                    if(asc16[k * 16 + i] & (0x80 >> j))
                        /* draw a point on the lcd */
                    {
                        lcd_draw_point(x + j, y + i, fc);
                    } else {
                        if(fc != bc)
                            /* draw a point on the lcd */
                        {
                            lcd_draw_point(x + j, y + i, bc);
                        }
                    }
                }
            s ++;
            x += 8;
        } else {
            for(k = 0; k < hz24_num; k ++) {
                if((hz24[k].Index[0] == *(s)) && (hz24[k].Index[1] == *(s + 1))) {
                    for(i = 0; i < 24; i ++) {
                        for(j = 0; j < 8; j ++) {
                            if(hz24[k].Msk[i * 3] & (0x80 >> j))
                                /* draw a point on the lcd */
                            {
                                lcd_draw_point(x + j, y + i, fc);
                            } else {
                                if(fc != bc)
                                    /* draw a point on the lcd */
                                {
                                    lcd_draw_point(x + j, y + i, bc);
                                }
                            }
                        }
                        for(j = 0; j < 8; j ++) {
                            if(hz24[k].Msk[i * 3 + 1] & (0x80 >> j))
                                /* draw a point on the lcd */
                            {
                                lcd_draw_point(x + j + 8, y + i, fc);
                            } else {
                                if(fc != bc)
                                    /* draw a point on the lcd */
                                {
                                    lcd_draw_point(x + j + 8, y + i, bc);
                                }
                            }
                        }
                        for(j = 0; j < 8; j ++) {
                            if(hz24[k].Msk[i * 3 + 2] & (0x80 >> j))
                                /* draw a point on the lcd */
                            {
                                lcd_draw_point(x + j + 16, y + i, fc);
                            } else {
                                if(fc != bc)
                                    /* draw a point on the lcd */
                                {
                                    lcd_draw_point(x + j + 16, y + i, bc);
                                }
                            }
                        }
                    }
                }
            }
            s += 3;
            x += 24;
        }
    }
    LCD_CS_SET;
}

/*!
    \brief      gui draw font to num32
    \param[in]  x: the x position of the start point
    \param[in]  y: the y position of the start point
    \param[in]  fc: display color of font
    \param[in]  bc: display background color
    \param[in]  num: display num
    \param[out] none
    \retval     none
*/
void lcd_draw_font_num32(uint16_t x, uint16_t y, uint16_t fc, uint16_t bc, uint16_t num)
{
    unsigned char i, j, k, c;

    LCD_CS_CLR;
    for(i = 0; i < 32; i ++) {
        for(j = 0; j < 4; j++) {
            c = *(sz32 + num * 32 * 4 + i * 4 + j);
            for(k = 0; k < 8; k ++) {
                if(c & (0x80 >> k))
                    /* draw a point on the lcd */
                {
                    lcd_draw_point(x + j * 8 + k, y + i, fc);
                } else {
                    if(fc != bc)
                        /* draw a point on the lcd */
                    {
                        lcd_draw_point(x + j * 8 + k, y + i, bc);
                    }
                }
            }
        }
    }
    LCD_CS_SET;
}
